; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared0 - mode
	infrared1 - mode
	thermograph2 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Phenomenon22 - direction
	Phenomenon23 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet20)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star15)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument8 infrared1)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star1)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star1)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
)
(:goal (and
	(have_image Phenomenon4 thermograph2)
	(have_image Planet5 infrared1)
	(have_image Star6 infrared0)
	(have_image Planet7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 thermograph2)
	(have_image Planet11 infrared0)
	(have_image Planet13 infrared1)
	(have_image Star14 thermograph2)
	(have_image Star15 infrared0)
	(have_image Star16 infrared0)
	(have_image Star17 infrared0)
	(have_image Phenomenon18 infrared0)
	(have_image Planet19 infrared0)
	(have_image Planet20 infrared0)
	(have_image Phenomenon21 thermograph2)
	(have_image Phenomenon22 infrared0)
	(have_image Phenomenon23 infrared0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 18
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 18
3. (turn_to satellite2 star0 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star0)
   goals met: 0 of 18
4. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 18
5. (turn_to satellite2 phenomenon18 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon18)
   goals met: 0 of 18
6. (take_image satellite2 phenomenon18 instrument4 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 1 of 18
7. (turn_to satellite2 phenomenon21 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon21)
   goals met: 1 of 18
8. (take_image satellite2 phenomenon21 instrument4 thermograph2)
   added: (have_image phenomenon21 thermograph2)
   goals met: 2 of 18
9. (turn_to satellite2 phenomenon22 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 phenomenon22)
   goals met: 2 of 18
10. (take_image satellite2 phenomenon22 instrument4 infrared0)
   added: (have_image phenomenon22 infrared0)
   goals met: 3 of 18
11. (turn_to satellite2 phenomenon23 phenomenon22)
   deleted: (pointing satellite2 phenomenon22)
   added: (pointing satellite2 phenomenon23)
   goals met: 3 of 18
12. (take_image satellite2 phenomenon23 instrument4 infrared0)
   added: (have_image phenomenon23 infrared0)
   goals met: 4 of 18
13. (turn_to satellite2 phenomenon4 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 phenomenon4)
   goals met: 4 of 18
14. (take_image satellite2 phenomenon4 instrument4 thermograph2)
   added: (have_image phenomenon4 thermograph2)
   goals met: 5 of 18
15. (turn_to satellite2 phenomenon8 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 phenomenon8)
   goals met: 5 of 18
16. (take_image satellite2 phenomenon8 instrument4 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 6 of 18
17. (turn_to satellite2 planet11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet11)
   goals met: 6 of 18
18. (take_image satellite2 planet11 instrument4 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 7 of 18
19. (turn_to satellite2 planet13 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet13)
   goals met: 7 of 18
20. (take_image satellite2 planet13 instrument4 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 8 of 18
21. (turn_to satellite2 planet19 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet19)
   goals met: 8 of 18
22. (take_image satellite2 planet19 instrument4 infrared0)
   added: (have_image planet19 infrared0)
   goals met: 9 of 18
23. (turn_to satellite2 planet20 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 planet20)
   goals met: 9 of 18
24. (take_image satellite2 planet20 instrument4 infrared0)
   added: (have_image planet20 infrared0)
   goals met: 10 of 18
25. (turn_to satellite2 planet5 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet5)
   goals met: 10 of 18
26. (take_image satellite2 planet5 instrument4 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 11 of 18
27. (turn_to satellite2 planet7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet7)
   goals met: 11 of 18
28. (take_image satellite2 planet7 instrument4 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 12 of 18
29. (turn_to satellite2 star14 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star14)
   goals met: 12 of 18
30. (take_image satellite2 star14 instrument4 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 13 of 18
31. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 13 of 18
32. (take_image satellite2 star15 instrument4 infrared0)
   added: (have_image star15 infrared0)
   goals met: 14 of 18
33. (turn_to satellite2 star16 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star16)
   goals met: 14 of 18
34. (take_image satellite2 star16 instrument4 infrared0)
   added: (have_image star16 infrared0)
   goals met: 15 of 18
35. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 15 of 18
36. (take_image satellite2 star17 instrument4 infrared0)
   added: (have_image star17 infrared0)
   goals met: 16 of 18
37. (turn_to satellite2 star6 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star6)
   goals met: 16 of 18
38. (take_image satellite2 star6 instrument4 infrared0)
   added: (have_image star6 infrared0)
   goals met: 17 of 18
39. (turn_to satellite2 star9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star9)
   goals met: 17 of 18
40. (take_image satellite2 star9 instrument4 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 18 of 18
